#Requires AutoHotkey v2.0
#SingleInstance Force

; English Numbers
:?*:1st::1ˢᵗ
:?*:2nd::2ⁿᵈ
:?*:3rd::3ʳᵈ
:?*:4th::4ᵗʰ
:?*:5th::5ᵗʰ
:?*:6th::6ᵗʰ
:?*:7th::7ᵗʰ
:?*:8th::8ᵗʰ
:?*:9th::9ᵗʰ
:?*:0th::0ᵗʰ

; French Numbers
:?*:1er::1ᵉʳ
:?*:2e::2ᵉ
:?*:3e::3ᵉ
:?*:4e::4ᵉ
:?*:5e::5ᵉ
:?*:6e::6ᵉ
:?*:7e::7ᵉ
:?*:8e::8ᵉ
:?*:9e::9ᵉ
:?*:0e::0ᵉ

; Fractions
:?*:1/2::½
:?*:1/3::⅓
:?*:2/3::⅔
:?*:1/4::¼
:?*:3/4::¾
:?*:1/5::⅕
:?*:2/5::⅖
:?*:3/5::⅗
:?*:4/5::⅘
:?*:1/6::⅙
:?*:5/6::⅚
:?*:1/8::⅛
:?*:3/8::⅜
:?*:5/8::⅝
:?*:7/8::⅞

; Temperatures
:?*:oC::°C
:?*:oF::°F
